var hinduMaleFirstNames = [
    "অমিয়",
    "অনুপ",
    "অজয়",
    "অভিষেক",
    "রবীন্দ্রনাথ",
    "সুমন্ত",
];

var hinduMaleLastNames = [
    "গাঙ্গুলী",
    "গোস্বামী",
    "ঘোষ",
    "চক্রবর্তী",
    "চৌধুরি",
    "ঠাকুর",
    "দেওয়ান",
    "ধর",
    "পাল",
    "পোদ্দার",
    "বসাক",
    "বণিক",
    "বর্মণ",
    "বসু",
    "বাগচী",
    "বিশ্বাস",
    "ব্যানার্জী",
    "ভাদুড়ী",
    "ভট্টাচার্য্য",
    "মজুমদার",
    "মল্লিক",
    "মাইতি",
    "মুখার্জী",
    "মৈত্র",
    "রায়",
    "লাহিড়ী",
    "দত্ত",
    "দাস",
    "দেব",
    "সেন",
    "হাজরা",
];

var hinduMaleNames = generateRandomNames(
    hinduMaleFirstNames,
    hinduMaleLastNames
);
