var muslimFemaleFirstNames = [
    "ইনায়া",
    "ইলোরা",
    "কুলসুম",
    "খায়রুন",
    "চম্পা",
    "জাহানারা",
    "টুম্পা",
    "ডালিয়া",
    "তানিয়া",
    "তন্বী",
    "নাজমা",
    "নাজিয়া",
    "নিম্মী",
    "পপি",
    "পাপিয়া",
    "ফারজানা",
    "ফারহানা",
    "বিলকিস",
    "মালিহা",
    "রেজওয়ানা",
    "রেদওয়ানা",
    "শিরিন",
    "সামিয়া",
    "সুমনা",
    "সুমাইয়া",
    "হাফসা",
    "হানুফা",
    "হুমায়রা",
];

var muslimFemaleLastNames = [
    "ইসলাম",
    "খাতুন",
    "খান",
    "তালুকদার",
    "নেসা",
    "বেগ",
    "বেগম",
    "হাওলাদার",
    "হায়দার",
];

var muslimFemaleNames = generateRandomNames(
    muslimFemaleFirstNames,
    muslimFemaleLastNames
);
